export const ru = {
    start: 'Начать',
    start_game: {
        title: 'Бесконечные истории'
    },
    environment: 'Окружение',
    gameObjectLife: '{name} (Здоровье: {hp}/{hpMax})',
    game_over_text: 'К сожалению, вы не справились с миссией и проиграли!',
    gate: 'Врата',
    go: 'Перейти',
    wall: 'Стена',
    missions_not: 'Других миссий пока нет',
    location: {
        not_open: {
           nearest: {
                title: 'Локация не исследована',
                text: 'Перейдите в локацию, что бы исследовать её.',
            },
            far: {
                title: 'Локация не исследована и далеко',
                text: 'Перейдите в ближайшую локацию, что бы появилась возможность перейти в эту.',
            }
        }
    },
    treasury: 'Сокровищница',
    escape_success: '{hero} хотел(а) переместиться и враг не смог этому помешать.',
    guard_fail_walked_to_date: 'Подозревающий страж с грозным видом шёл к Датэ, но к нему резко подскочил другой солдат, ' +
        'подхватил под руку и потащил куда-то в другую сторону.',
    guard_walked_to_hero: 'В новой локации стоял стражник, который опознал в "{hero}" чужака и сразу же перешёл в нападение!',
    talk_maid1: 'Спросить, почему она злая.',
    talk_maid1_text: '"Что за глупый вопрос?! Новенькая что ли?! Ну да ладно! Расскажу! Конечно же, я зла из-за чёртового Саске! ' +
        'У меня уже зад болит от его шлепков и уши вянут от похабных предложений!" - поделилась переживания служанка',
    talk_maid2: 'Узнать как бы она хотела отомстить Сасуке.',
    talk_maid2_text: '"О-о-о... я бы напоила его вином, от котрого его пронесёт дальше, чем он видит!' +
        ' Пара кружек и весь вечер в сортире! Я уже даже замешала такое и спрятала под столом за мешком риса!' +
        ' Эх.. жаль у меня не хватает духу это сделать. Да... Ну ладно, спасибо, что выслушала. Надо дальше работать!" - сказала служанка и продолжила готовить.',
    take_vine: 'Забрать припрятанное вино',
    mauri_get_wine: 'Маюри получает вино',
    gunsmith: 'Оружейник',
    escape_fail: '{hero} хотел(а) переместиться, но враг загородил путь.',
    warning_castle: 'Внимание! Внутри замка стража может посчитать вас чужаком и напасть!',
    actions: 'Действия',
    missions: 'Миссии',
    attract_attention: 'Привлечь внимание',
    treasury_find: 'Поискать что-нибудь интересное',
    treasury_get_key: 'Подобрать ключ',
    treasury_key_founded: 'В сокровищах получилось отыскать необычный ключ',
    treasury_alarm: 'Осматривая сокровища, вы случайно задели заколдованный предмет, который призвал фантомных стражей.',
    treasury_key_taken_date: 'Дате подобрал ключ, но у него стало резко темнеть в глазах и он выбросил его.',
    treasury_key_taken_kitsune: 'Маюри подобрала ключ и у неё сильно закружилась голова, однако она сконцентрировалась и сняла чары с проклятого предмета.',
    give_wine: 'Дать вино',
    sasuke_fight: '"Это что за морда?! В атаку!" - прорычал Сасуке и позвал стражу.',
    sasuke_vine: 'Сасуке жадно выхватил бутылку и осушил её за считанные мгновения, после чего отвратительно рыгнул, шлёпнул Маюри по попе и продолжил застолье.' +
        ' Девушка даже не сразу поняла, что призошло, её смущение и злость накопились со временем, как и газы внутри живота Саске.' +
        ' Спустя время, его самодовольное, мерзкое лицо внезапно перекосила гримаса мучений и он резко убежал в уборную под подрунивания своей свиты.' +
        ' Ну что же, пришло время мести... грязной мести. ',
    climb_over: 'Перелезть',
    castle_exit: 'Покинуть замок',
    shoukou_casket: 'Шкатулка Сёко',
    shoukou_attack: 'Напасть',
    shoukou_attack_text_fail: 'Вы хотели подобраться к Сёко, но почувстовали страную тревожность, и решили, что лучше сделать это с созюником.',
    shoukou_attack_text_success: '"Ха-ха-ха! Очередные враги! Вы ничего не сможете мне сделать, а мои стражи сделают из вас кровавый фарш!"' +
        ' - бросил Сёко, затем достал какой-то бутылёк и разбил его об пол, что погрузило комнату в дым. Когда он рассеялся, ' +
        'Сёко в комнате уже не было, а на его месте стояли фантомные стражи, позади которых пугающе возвышался могучий, нефритовый голем.',
    shoukou_mega_guard_death: 'Нефритовый страж пал, а в его останках виднелась необычная шкатулка, от которой веяло волшебной силой.',
    shoukou_open_magick_box_open: 'Открыть шкатулку',
    shoukou_clear_magick: 'Маюри открыла шкатулку, скрестила руки на груди, закрыла глаза и стала  шептать волшебные слова.' +
        ' Когда резко коснулась указательным пальцем амулета. Казалось, что ничего не произошло, однако лицо Маюри выражало рядость от совершенной мести.' +
        ' Неважно сколько ещё отмерено Сёко, он точно не успеет найти способ вернуть бессмертие, он просто умрёт и его душа наконец-то отправится ад.' +
        ' Осталость только покинуть его поганый замок и схоронить амулет там, где его больше никто и никогда не найдёт. (Получено 2 новых задания!)',
    gate_storm: 'На штурм!',
    be_asked_to_enter: 'Попроcиться войти',
    hero_enter_castle: '{hero} попал(а) в замок',
    hero_out_castle: '{hero} покинул(а) замок',
    enter: 'Войти',
    date_fanat: 'Датэ сказал страже, что приглашён на развлекательный вечер к их феодалу, а приглашение потерял по дороге при забавных обстоятельствах. ' +
        'Эта история настолько позабавила охрану, что они решили его пропустить.',
    date_cancel: 'Датэ пытался убедить стражу, что он приглашён на приём, но ему не поверили и послали прочь.',
    ask_for_a_weapon: 'Попросить оружие',
    gunsmith_drove_date: 'На просьбу Датэ оружейник ответил, что тот и так вооружён до зубов и лучше бы ему заняться чем-то полезным.',
    gunsmith_did_not_nuclei: '"Какое оружие?! А-а-а... ты о ядрах для пушек. Ты что ли сама их понесёшь? Тащи сюда носильщика, дура!" - схамил оружейник и вернулся к своим делам.',
    gunsmith_give_nuclei_date: '"Какое оружие?! А-а-а... ты о ядрах для пушек. Хорошо, пусть их тащит твой уволень." - сказал оружейник и передал Датэ ядра.',
    guard_drives_away: 'Стража обнажила оружие!',
    reload_action: '{action}(Перезарядка: {reload})',
    chance_action: '{action}(Шанс: {chance}%)',
    active_spell: '{unit} применяет {spell}',
    damage: '"{unit}" получает {dmg} урон(а)',
    invulnerability_damage: '"{unit}" получает {dmg} урон(а), но он неуязим!',
    death: '"{unit}" умирает',
    maid: 'Служанка',
    select_targets: 'Выбор целей',
    select_targets_count: 'Выбор целей({current}/{need})',
    apply: 'Применить',
    character_use_activ: '"{owner}" применил(а) "{activ}" к "{target}"',
    chefs_table: 'Стол для готовки',
    wonderful_wine: {
        name: 'Чудесное вино',
        description: 'пара стаканчиков и весь вечер счасливчик проведёт в туалете',
    },
    crane_stroke: {
        name: 'Взмах журавля',
        description: '2 урона 3 целям на выбор. Перезарядка 2 хода.',
    },
    attack: {
        name: 'Атака',
        description: '1 урон цели.',
    },
    npc_attack: '"{npc}" атаковал(а) "{target}" ',
    health: {
        name: 'Лечение',
        description: 'восстанавливает 1 здоровье',
    },
    healed: '{unit} получает +{healed} к здоровью',
    menu: 'Меню',
    restart: 'Перезапуск',
    change_game: 'Выбрать другую игру',
    faq: 'Faq',
    characteristics: 'Характеристики',
    movePoints: 'Очки движения',
    actionsPoints: 'Очки действий',
    abilities: 'Способности',
    items: 'Предметы',
    effects: 'Эффекты',
    title_description: '{title} - {description}',
    title_description_for_passive_spell: '{title}(Ходов: {counter}) - {description}',
    title_description_for_active_spell: '{title}(Перезарядка: {counter}) - {description}',
    title_description_for_item: '{title}(Количество: {counter}) - {description}',
    hp: 'Здоровье',
    favorite_of_fortune: {
        name: 'Любимец Фортуны',
        description: 'дополнительный шанс провести любую проверку, а в бою даёт возможность нанести критический удар',
    },
    spell_cancel: '{spell}. Отменить.',
    gun: {
        name: 'Пушка',
        description: 'наносит 3 урона, требуются ядра для использования.',
        attack: 'Выстрел из пушки',
    },
    gun_shell: {
        name: 'Ядро',
        description: 'снаряд для пушки'
    },
    human_morph: {
        name: 'Форма человека',
        description: 'в форме человека -1 к перемещению и нельзя колдовать, зато на вас не будут нападать люди и вы сможете с ними говорить. ' +
            'Превратится в человека можно только когда рядом нет активных врагов!'
    },
    illusion: {
        name: 'Илюзии',
        description: 'погружает цель в мир илюзий на 1 ход. Перезаряжается 1 ход.'
    },
    kitsune_charm: {
        name: 'Чары кицуне',
        description: 'тяжело заставить себя поднять руку на милую лисичку, даже если она в облике девушки.',
        charm: 'Враг не смог поднять руку на милую лисичку!'
    },
    punch: {
        name: 'Удар в морду',
        description: 'наносит 1 урон и оглушает на 2 хода. Перезаряжается 2 хода.'
    },
    magick_key: {
        name: 'Волшебный ключ',
        description: 'этим ключом можно что-то открыть.',
    },
    stun: {
        name: 'Без сознания',
        description: 'персонаж пропускает свой ход.',
        effect: '{unit} без сознания. Ходов: {count}',
    },
    preparation_for_battle: {
        name: 'Подготовка к бою',
        description: 'персонаж пропускает ход, ожидая лучшего момента для действия.',
        effect: '{unit} готовится к бою. Ходов: {count}',
    },
    invulnerability: {
        name: 'Неуязвимость',
        description: 'персонаж неуязвим для любого урона.',
    },
    help: {
        punct1: {
            title: 'Суть игры',
            text: 'Вы играете за группу героев. У каждого из них свои цели, которые нужно достичь для прохождения миссии, также можно' +
                ' проиграть, если провалить' +
                ' какие-то задания.',
        },
        punct2: {
            title: 'Карта, зоны и локации',
            text: 'На карте есть зоны, а внутри них локации. Через некоторые действия можно перемещаться между зонами.' +
                ' Если локация чёрная, то её надо изучить, для чего нужно поместить в неё героя.' +
                ' Если кликнуть на исследованную локацию(белую), то можно увидеть её окружение.' +
                ' В режиме перемещения зелёным цветом показывает, в какие локации можно переместиться.',
        },
        punct3: {
            title: 'Перемещение в локацию',
            text: 'Что бы переместить героя, нужно кликнуть на иконку ботинка, а потом на нужную локацию. Если рядом враги, то,' +
                ' возможно, переместиться не получится.',
        },
        punct4: {
            title: 'Окружение локации',
            text: 'В локации могут находится герои, враги и объекты для взаимодействия. У персонажей есть иконка знака вопроса, при клике на неё вы получите' +
                ' информацию о нём. Кликнув на иконку руки, можно увидеть список действий.'
        },
        punct5: {
            title: 'Герой',
            text: 'Имеет зелёную рамку. У каждого героя есть здоровье, очки перемещения и очки действий(которые тратяться при' +
                ' перемещении и действиях соответсвеннно),' +
                ' а также способности и предметы.',
        },
        punct6: {
            title: 'Враг',
            text: 'Имеет красную рамку. Как и герой, но живёт, что бы убивать их.',
        },
        punct7: {
            title: 'Объект взаимодействия',
            text: 'Имеет серую рамку. Герои должны использовать действия',
        },
        punct8: {
            title: 'Способности персонажей',
            text: 'Они бывают активные и пассивные. Первые перезаряжаются после использования, вторые работают всегда. Активные' +
                ' спобности тратят очки действия.',
        },
        punct9: {
            title: 'Предметы',
            text: 'Бывают квестовые, расходные, стрелковые, снаряды. Первые нужны только для объектов взаимдействия, вторые' +
                ' используюется в зраных случаях и имеют количество,' +
                ' а вторые требуют снаряды. Использование предметов не тратят очки действий!',
        },


    },
    story1: {
        title: 'Замок Сёко',
        description: 'Два мстителя внезапно встретиилсь на пороге замка одного мерзкого феодала. ' +
            'Пообщавшись, они поняали, что вместе смогут достигнуть своих целей.',
        happy_end: 'Сасуке получил в морду, Сёке стал смертным, а герои благополучно покинули замок! Поздравляем! Это чистая победа!',
        outer_courtyard: 'Внешний двор',
        hosokawa_castle: 'Замок Хосокавы',
        kitsune: {
            name: 'Маюри',
            description: 'Маюри - потомственная кицуне. Её мать Холо была высшей жрицей девяти лун и обладала волшебным амулетом,' +
                ' в который можно было поместить душу существа, что делало его тело бессмертным. У жрицы было множество коварных врагов.' +
                ' Один из них рассказал об амулете феодалу Сёко и пообещал провести ритуал для обретения бессмертия, если он уничтожит Холо и её деревню.' +
                ' Уговаривать Сёко пришлось недолго, ведь он был исключительно коварным типом, к тому же он умирал от болезни.' +
                ' Оставались считанные дни и Сёко был готов на всё ради жизни!' +
                ' Колдун подавил магию лисиц, а солдаты сделали всё остальное. Лишь Маюри удалось спастись, а Сёко стал бессмертным.' +
                ' Юная лисица долго оплакивала смерть близких, но потом решила, что не может оставить всё как есть! ' +
                ' В мире и так полно чудовищ с людскими лицами и бессмертными они быть не должны!' +
                ' И вот Маюри отправилась во дворец Сёко, что бы развеять чары семейной реликвии и вернуть её себе!'
        },
        warrior: {
            name: 'Датэ',
            description: 'Могучий воин, любимец самой матушки-фортуны и просто неистовый балагур. Не так давно Датэ попал в передрягу с неким Сасуке.' +
                ' Он высмеял его надменность и поборол на руках, после чего сразу же получил кулаком в щёку от проигравшего и стулом' +
                ' со спины от его прихвостней, которые в миг вышвырнули его в окно со второго этажа трактира.' +
                ' Приземлился Дате на знойную лошадь и та галопом понесла его вдаль. Когда он смог её успокоить и вернутся в трактир, Саске там уже не было.' +
                ' Ночь закончилась несправедливостью, но утром после пары кружек Дате отправился вернуть должок за синяк под глазом, даже если вернуть' +
                ' его придётся самому главе стражы местного феодала!',
            date_luck: 'Удача Датэ сработала!',
            date_luck_attack: 'Датэ наносит критический удар!',
        },
        guard: {
            name: 'Страж',
            description: ''
        },
        jade_guard: {
            name: 'Нефритовый страж',
            description: 'Волшебное, могучее существо, созданное из самого нефрита! Палкой и зубилом такого не разломать!'
        },
        sasuke: {
            name: 'Сасуке',
            description: 'Опытный, крепикий, но хитрый начальник стражи. Абсолютно под стать своему феодалу.' +
                ' В бою при всей своей реальной силе всегда предподчёт сражение в компании своих прихвостней, особенно, когда противник совершенно один.' +
                ' Саске определённо заслуживает получить по морде!'
        },
        shoukou: {
            name: 'Сёко',
            description: 'Зажиточный феодал, настолько же богатый, насколько жадный и коварный. Всю жизнь ходил по головам' +
                ' себе подобных, а крестьян считал жалкими червями, с которыми можно творить всё что вздумается. Высшие чины знали' +
                ' о его злых деяниях, однако он славно пополнял императорскую казну, поэтому продолжал жить в своё удовольствие.' +
                ' Лишь под старость лет небеса нкаазали его смертельным недугом, однако загадочный колдун помог ему обрести бессмертие,' +
                ' платой за что стала всего-лишь жизнь целого поселения кицуне. Да помогут же небеса героям вновь сделать смертным это чудовище, что бы' +
                ' в скорем времени его гадкую плоить забрала сама, а душа отправилась прямком в ад!'
        },
        quests: {
            sasuke_punch: 'Дать Саске в морду!',
            shoukou_mortal: 'Нужно лишить Сёко бессмертия',
            hero_death: 'Все герои должны выжить',
            sasuke_death_before_punch: 'Саске не должен умереть, пока не получит по морде!',
            escape_date: 'Датэ должен покинуть замок',
            escape_mauri: 'Маюри должна покинуть замок',
        }
    }
};